Tekla Open API Reference for Tekla Structures 2025
StringList.IndexOf Method
Overload List
Name | Description
IndexOf(String)
 Gets the index of the specified string.
IndexOf(String, Int32)
 Gets the index of the specified string between the index to start the search from and the end of the list.
IndexOf(String, Int32, Int32)
 Gets the index of the specified string between the index to start the search from and startIndex + count.
Top
See Also
Reference
StringList Class
Tekla.Structures.Drawing Namespace